[Survived] ObjectLiteral
src/config/uploadAndMulter.ts:5:40
 import crypto from "node:crypto";
 import multer from "multer";
 
-const diskStorage = multer.diskStorage({
-  destination: (req, file, cb) => {
-    cb(null, path.resolve(__dirname, "..", "..", "uploads"));
-  },
-  filename: (req, file, cb) => {
-    const hash = crypto.randomBytes(16).toString("hex");
-    const filename = `${hash}-${file.originalname}`;
-    cb(null, filename);
-  },
-});
+const diskStorage = multer.diskStorage({});
 
 const cloudStorage = multer.memoryStorage();

[NoCoverage] StringLiteral
src/config/uploadAndMulter.ts:7:50
 
 const diskStorage = multer.diskStorage({
   destination: (req, file, cb) => {
-    cb(null, path.resolve(__dirname, "..", "..", "uploads"));
+    cb(null, path.resolve(__dirname, "..", "..", ""));
   },
   filename: (req, file, cb) => {

[NoCoverage] ConditionalExpression
src/config/uploadAndMulter.ts:20:7
 
 // Filtro para aceitar apenas imagens
 const fileFilter = (req: any, file: any, cb: any) => {
-  if (file.mimetype.startsWith("image/")) {
+  if (true) {
     cb(null, true);
   } else {

[NoCoverage] MethodExpression
src/config/uploadAndMulter.ts:20:7
 
 // Filtro para aceitar apenas imagens
 const fileFilter = (req: any, file: any, cb: any) => {
-  if (file.mimetype.startsWith("image/")) {
+  if (file.mimetype.endsWith("image/")) {
     cb(null, true);
   } else {

[NoCoverage] BooleanLiteral
src/config/uploadAndMulter.ts:21:14
 // Filtro para aceitar apenas imagens
 const fileFilter = (req: any, file: any, cb: any) => {
   if (file.mimetype.startsWith("image/")) {
-    cb(null, true);
+    cb(null, false);
   } else {
     cb(

[NoCoverage] BooleanLiteral
src/config/uploadAndMulter.ts:25:7
   } else {
     cb(
       new Error("Tipo de arquivo inválido. Apenas imagens são permitidas."),
-      false,
+      true,
     );
   }

[Killed] EqualityOperator
src/config/uploadAndMulter.ts:31:3
 };
 
 export const isCloudUploadDestination =
-  process.env.UPLOAD_DESTINATION === "cloud";
+  process.env.UPLOAD_DESTINATION !== "cloud";
 
 export const upload = multer({
killedBy: Upload and Multer Config Upload Destination Logic should set isCloudUploadDestination to false when UPLOAD_DESTINATION is not "cloud"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/config/uploadAndMulter.ts:31:3
 };
 
 export const isCloudUploadDestination =
-  process.env.UPLOAD_DESTINATION === "cloud";
+  false;
 
 export const upload = multer({
killedBy: Upload and Multer Config Upload Destination Logic should set isCloudUploadDestination to true when UPLOAD_DESTINATION is "cloud"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
