[Killed] ObjectLiteral
src/config/auth.ts:5:20
 
 config();
 
-const authConfig = {
-  jwtSecret: process.env.JWT_SECRET || "your_jwt_secret",
-  jwtExpiration: process.env.JWT_EXPIRATION || "1h",
-  jwtLongExpiration: process.env.JWT_EXPIRATION || "7d",
-  jwt2FAExpiration: process.env.JWT_2FA_EXPIRATION || "5m",
-  refreshTokenSecret:
-    process.env.REFRESH_TOKEN_SECRET || "your_refresh_token_secret",
-  refreshTokenExpiration: process.env.REFRESH_TOKEN_EXPIRATION || "7d",
-  saltRounds: Number.parseInt(process.env.SALT_ROUNDS || "12", 10),
-};
+const authConfig = {};
 
 export default authConfig;
killedBy: AuthService login should successfully login user without 2FA
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"id": "user123", "permissions": ["read"], "sessionVersion": 1},
- Any<String>,
+ undefined,

[Killed] ConditionalExpression
src/config/auth.ts:6:14
 config();
 
 const authConfig = {
-  jwtSecret: process.env.JWT_SECRET || "your_jwt_secret",
+  jwtSecret: false,
   jwtExpiration: process.env.JWT_EXPIRATION || "1h",
   jwtLongExpiration: process.env.JWT_EXPIRATION || "7d",
killedBy: Auth Config should use default values when environment variables are not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "your_jwt_secret"
Received: false

[Killed] ConditionalExpression
src/config/auth.ts:6:14
 config();
 
 const authConfig = {
-  jwtSecret: process.env.JWT_SECRET || "your_jwt_secret",
+  jwtSecret: true,
   jwtExpiration: process.env.JWT_EXPIRATION || "1h",
   jwtLongExpiration: process.env.JWT_EXPIRATION || "7d",
killedBy: Auth Config should use default values when environment variables are not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "your_jwt_secret"
Received: true

[Killed] ConditionalExpression
src/config/auth.ts:7:18
 
 const authConfig = {
   jwtSecret: process.env.JWT_SECRET || "your_jwt_secret",
-  jwtExpiration: process.env.JWT_EXPIRATION || "1h",
+  jwtExpiration: true,
   jwtLongExpiration: process.env.JWT_EXPIRATION || "7d",
   jwt2FAExpiration: process.env.JWT_2FA_EXPIRATION || "5m",
killedBy: AuthService login should successfully login user without 2FA
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"id": "user123", "permissions": ["read"], "sessionVersion": 1},
- Any<String>,
+ true,

[Timeout] LogicalOperator
src/config/auth.ts:7:18
 
 const authConfig = {
   jwtSecret: process.env.JWT_SECRET || "your_jwt_secret",
-  jwtExpiration: process.env.JWT_EXPIRATION || "1h",
+  jwtExpiration: process.env.JWT_EXPIRATION && "1h",
   jwtLongExpiration: process.env.JWT_EXPIRATION || "7d",
   jwt2FAExpiration: process.env.JWT_2FA_EXPIRATION || "5m",

[Timeout] ConditionalExpression
src/config/auth.ts:8:22
 const authConfig = {
   jwtSecret: process.env.JWT_SECRET || "your_jwt_secret",
   jwtExpiration: process.env.JWT_EXPIRATION || "1h",
-  jwtLongExpiration: process.env.JWT_EXPIRATION || "7d",
+  jwtLongExpiration: false,
   jwt2FAExpiration: process.env.JWT_2FA_EXPIRATION || "5m",
   refreshTokenSecret:

[Timeout] ConditionalExpression
src/config/auth.ts:8:22
 const authConfig = {
   jwtSecret: process.env.JWT_SECRET || "your_jwt_secret",
   jwtExpiration: process.env.JWT_EXPIRATION || "1h",
-  jwtLongExpiration: process.env.JWT_EXPIRATION || "7d",
+  jwtLongExpiration: true,
   jwt2FAExpiration: process.env.JWT_2FA_EXPIRATION || "5m",
   refreshTokenSecret:

[Killed] LogicalOperator
src/config/auth.ts:9:21
   jwtSecret: process.env.JWT_SECRET || "your_jwt_secret",
   jwtExpiration: process.env.JWT_EXPIRATION || "1h",
   jwtLongExpiration: process.env.JWT_EXPIRATION || "7d",
-  jwt2FAExpiration: process.env.JWT_2FA_EXPIRATION || "5m",
+  jwt2FAExpiration: process.env.JWT_2FA_EXPIRATION && "5m",
   refreshTokenSecret:
     process.env.REFRESH_TOKEN_SECRET || "your_refresh_token_secret",
killedBy: AuthService login should return 2FA requirement when user has twoFactorSecret
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"id": "user123", "twoFactorRequired": true},
- Any<String>,
+ undefined,

[Killed] ConditionalExpression
src/config/auth.ts:9:21
   jwtSecret: process.env.JWT_SECRET || "your_jwt_secret",
   jwtExpiration: process.env.JWT_EXPIRATION || "1h",
   jwtLongExpiration: process.env.JWT_EXPIRATION || "7d",
-  jwt2FAExpiration: process.env.JWT_2FA_EXPIRATION || "5m",
+  jwt2FAExpiration: false,
   refreshTokenSecret:
     process.env.REFRESH_TOKEN_SECRET || "your_refresh_token_secret",
killedBy: AuthService login should return 2FA requirement when user has twoFactorSecret
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"id": "user123", "twoFactorRequired": true},
- Any<String>,
+ false,

[Killed] ConditionalExpression
src/config/auth.ts:11:5
   jwtLongExpiration: process.env.JWT_EXPIRATION || "7d",
   jwt2FAExpiration: process.env.JWT_2FA_EXPIRATION || "5m",
   refreshTokenSecret:
-    process.env.REFRESH_TOKEN_SECRET || "your_refresh_token_secret",
+    false,
   refreshTokenExpiration: process.env.REFRESH_TOKEN_EXPIRATION || "7d",
   saltRounds: Number.parseInt(process.env.SALT_ROUNDS || "12", 10),
killedBy: Auth Config should use default values when environment variables are not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "your_refresh_token_secret"
Received: false

[Killed] LogicalOperator
src/config/auth.ts:11:5
   jwtLongExpiration: process.env.JWT_EXPIRATION || "7d",
   jwt2FAExpiration: process.env.JWT_2FA_EXPIRATION || "5m",
   refreshTokenSecret:
-    process.env.REFRESH_TOKEN_SECRET || "your_refresh_token_secret",
+    process.env.REFRESH_TOKEN_SECRET && "your_refresh_token_secret",
   refreshTokenExpiration: process.env.REFRESH_TOKEN_EXPIRATION || "7d",
   saltRounds: Number.parseInt(process.env.SALT_ROUNDS || "12", 10),
killedBy: Auth Config should use default values when environment variables are not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "your_refresh_token_secret"
Received: undefined

[Timeout] ConditionalExpression
src/config/auth.ts:12:27
   jwt2FAExpiration: process.env.JWT_2FA_EXPIRATION || "5m",
   refreshTokenSecret:
     process.env.REFRESH_TOKEN_SECRET || "your_refresh_token_secret",
-  refreshTokenExpiration: process.env.REFRESH_TOKEN_EXPIRATION || "7d",
+  refreshTokenExpiration: false,
   saltRounds: Number.parseInt(process.env.SALT_ROUNDS || "12", 10),
 };

[Timeout] LogicalOperator
src/config/auth.ts:12:27
   jwt2FAExpiration: process.env.JWT_2FA_EXPIRATION || "5m",
   refreshTokenSecret:
     process.env.REFRESH_TOKEN_SECRET || "your_refresh_token_secret",
-  refreshTokenExpiration: process.env.REFRESH_TOKEN_EXPIRATION || "7d",
+  refreshTokenExpiration: process.env.REFRESH_TOKEN_EXPIRATION && "7d",
   saltRounds: Number.parseInt(process.env.SALT_ROUNDS || "12", 10),
 };

[Killed] ConditionalExpression
src/config/auth.ts:13:31
   refreshTokenSecret:
     process.env.REFRESH_TOKEN_SECRET || "your_refresh_token_secret",
   refreshTokenExpiration: process.env.REFRESH_TOKEN_EXPIRATION || "7d",
-  saltRounds: Number.parseInt(process.env.SALT_ROUNDS || "12", 10),
+  saltRounds: Number.parseInt(false, 10),
 };
 
killedBy: Auth Config should use default values when environment variables are not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: NaN

[Killed] LogicalOperator
src/config/auth.ts:13:31
   refreshTokenSecret:
     process.env.REFRESH_TOKEN_SECRET || "your_refresh_token_secret",
   refreshTokenExpiration: process.env.REFRESH_TOKEN_EXPIRATION || "7d",
-  saltRounds: Number.parseInt(process.env.SALT_ROUNDS || "12", 10),
+  saltRounds: Number.parseInt(process.env.SALT_ROUNDS && "12", 10),
 };
 
killedBy: Auth Config should use default values when environment variables are not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: NaN
